; domain
(define (domain messy_house)
	(:requirements :strips)
	(:predicates 
		(at ?c ?x) (next ?from ?to) (holding ?x) (empty-hands ?c) (half-open ?k) (door-between ?x ?y) (dust-in ?x) 
		(cleaner ?c) (trash ?t) (key ?k) (vacuum ?v) (place ?p) (safe-place ?s) (recycle ?t) (open ?x) (empty-sack ?c) (in-sack ?t))

	(:action move
		:parameters (?c ?from ?to)
		:precondition (and (cleaner ?c) (at ?c ?from) (next ?from ?to) (next ?to ?from) (place ?from) (or (place ?to) (safe-place ?to))
						(not (door-between ?from ?to)) (not (door-between ?to ?from)) (not (dust-in ?to)))
		:effect ( and (at ?c ?to) (not (at ?c ?from)))
			 
	)
	
	(:action recycle_trash
	    :parameters (?c ?p ?t)
	    :precondition (and (cleaner ?c) (trash ?t) (safe-place ?p) (in-sack ?t) (at ?c ?p))
	    :effect (and (recycle ?t) (empty-sack ?c) (not (in-sack ?t)))
	    )

	(:action grab_tool
		:parameters (?c ?p ?l)
		:precondition (and (cleaner ?c) (place ?p) (at ?c ?p) (at ?l ?p) (empty-hands ?c) (or (key ?l) (vacuum ?l))
				)
		:effect (and (holding ?l) (not (empty-hands ?c)) (not (at ?l ?p)))
	)

	(:action drop_tool
		:parameters (?c ?p ?l)
		:precondition (and (cleaner ?c) (place ?p) (at ?c ?p) (holding ?l) (or (key ?l) (vacuum ?l)) )
		:effect (and (at ?l ?p) (empty-hands ?c) (not (holding ?l)))
	)

	(:action put_in_sack
		:parameters (?c ?p ?t)
		:precondition (and (cleaner ?c) (trash ?t) (place ?p) (at ?c ?p) (at ?t ?p) (empty-sack ?c))
		:effect ( and (in-sack ?t) (not (empty-sack ?c)) (not (at ?t ?p)))
	)


	(:action open_room
		:parameters (?c ?from ?to ?k)
		:precondition (and (cleaner ?c) (place ?from) (place ?to) (key ?k) (at ?c ?from)  (door-between ?from ?to)
						(holding ?k) (not (open ?k)))
		:effect (and (not (door-between ?from ?to)) (not (door-between ?to ?from))
			(when (half-open ?k) (open ?k)) (when (not (half-open ?k)) (and (half-open ?k))))
	)

	(:action vacuum_dust
		:parameters (?c ?from ?to ?v)
		:precondition (and (cleaner ?c) (place ?from) (place ?to) (next ?from ?to) (next ?to ?from) (vacuum ?v) (at ?c ?from) (dust-in ?to) (holding ?v))
		:effect (and (not (dust-in ?to)))
	)

)

; problem
(define (problem second_house)
	(:domain messy_house)
		(:objects cleaner trash1 trash2 trash3 key vacuum
		    out r11 r12 r13 r21 r22 r23 r24 r31 r32 r33 r41 r42 r43)
		(:init  (trash trash1) (trash trash2) (trash trash3) (cleaner cleaner) (key key) (vacuum vacuum)
		        (at cleaner r13) (at trash1 r11) (at trash2 r21) (at trash3 r23) (dust-in r12) (dust-in r22) (dust-in r31)
				(at vacuum r24) (at key r42)
				(empty-hands cleaner) (safe-place out) (empty-sack cleaner)
				
				(place r11) (place r12) (place r13) 
				(place r21) (place r22) (place r23) (place r24) 
				(place r31) (place r32) (place r33)
				(place r41) (place r42) (place r43)
				(place out)
				(next r11 r12) (next r12 r11) (next r11 r21) (next r21 r11) (next r21 r22) (next r22 r21)
				(next r21 r31) (next r31 r21) (next r31 r32) (next r32 r31) (next r31 r41) (next r41 r31)
				(next r41 r42) (next r42 r41) (next r42 r32) (next r32 r42) (next r42 r43) (next r43 r42)
				(next r32 r22) (next r22 r32) (next r32 r33) (next r33 r32) (next r22 r12) (next r12 r22) 
				(next r22 r23) (next r23 r22) (next r12 r13) (next r13 r12) (next r13 r23) (next r23 r13) 
				(next r23 r33) (next r33 r23) (next r23 r24) (next r24 r23) (next r33 r43) (next r43 r33)
				(next r43 out) (next out r43)    

				(door-between r11 r12) (door-between r12 r11) (door-between r11 r21) (door-between r21 r11)
				(door-between r21 r22) (door-between r22 r21)
		)
		(:goal (and (recycle trash1) (recycle trash2) (recycle trash3)))
)

; plan
1. (move cleaner r13 r23)
   deleted: (at cleaner r13)
   added: (at cleaner r23)
   goals met: 0 of 3
2. (put_in_sack cleaner r23 trash3)
   deleted: (empty-sack cleaner) (at trash3 r23)
   added: (in-sack trash3)
   goals met: 0 of 3
3. (move cleaner r23 r33)
   deleted: (at cleaner r23)
   added: (at cleaner r33)
   goals met: 0 of 3
4. (move cleaner r33 r43)
   deleted: (at cleaner r33)
   added: (at cleaner r43)
   goals met: 0 of 3
5. (move cleaner r43 out)
   deleted: (at cleaner r43)
   added: (at cleaner out)
   goals met: 0 of 3
6. (recycle_trash cleaner out trash3)
   deleted: (in-sack trash3)
   added: (recycle trash3) (empty-sack cleaner)
   goals met: 1 of 3
7. (move cleaner out r43)
   deleted: (at cleaner out)
   added: (at cleaner r43)
   goals met: 1 of 3
8. (move cleaner r43 r42)
   deleted: (at cleaner r43)
   added: (at cleaner r42)
   goals met: 1 of 3
9. (grab_tool cleaner r42 key)
   deleted: (empty-hands cleaner) (at key r42)
   added: (holding key)
   goals met: 1 of 3
10. (move cleaner r42 r43)
   deleted: (at cleaner r42)
   added: (at cleaner r43)
   goals met: 1 of 3
11. (drop_tool cleaner r43 key)
   deleted: (holding key)
   added: (at key r43) (empty-hands cleaner)
   goals met: 1 of 3
12. (move cleaner r43 r33)
   deleted: (at cleaner r43)
   added: (at cleaner r33)
   goals met: 1 of 3
13. (move cleaner r33 r23)
   deleted: (at cleaner r33)
   added: (at cleaner r23)
   goals met: 1 of 3
14. (move cleaner r23 r24)
   deleted: (at cleaner r23)
   added: (at cleaner r24)
   goals met: 1 of 3
15. (grab_tool cleaner r24 vacuum)
   deleted: (empty-hands cleaner) (at vacuum r24)
   added: (holding vacuum)
   goals met: 1 of 3
16. (move cleaner r24 r23)
   deleted: (at cleaner r24)
   added: (at cleaner r23)
   goals met: 1 of 3
17. (move cleaner r23 r33)
   deleted: (at cleaner r23)
   added: (at cleaner r33)
   goals met: 1 of 3
18. (move cleaner r33 r32)
   deleted: (at cleaner r33)
   added: (at cleaner r32)
   goals met: 1 of 3
19. (vacuum_dust cleaner r32 r31 vacuum)
   deleted: (dust-in r31)
   goals met: 1 of 3
20. (move cleaner r32 r31)
   deleted: (at cleaner r32)
   added: (at cleaner r31)
   goals met: 1 of 3
21. (move cleaner r31 r21)
   deleted: (at cleaner r31)
   added: (at cleaner r21)
   goals met: 1 of 3
22. (put_in_sack cleaner r21 trash2)
   deleted: (empty-sack cleaner) (at trash2 r21)
   added: (in-sack trash2)
   goals met: 1 of 3
23. (move cleaner r21 r31)
   deleted: (at cleaner r21)
   added: (at cleaner r31)
   goals met: 1 of 3
24. (move cleaner r31 r41)
   deleted: (at cleaner r31)
   added: (at cleaner r41)
   goals met: 1 of 3
25. (move cleaner r41 r42)
   deleted: (at cleaner r41)
   added: (at cleaner r42)
   goals met: 1 of 3
26. (move cleaner r42 r43)
   deleted: (at cleaner r42)
   added: (at cleaner r43)
   goals met: 1 of 3
27. (move cleaner r43 out)
   deleted: (at cleaner r43)
   added: (at cleaner out)
   goals met: 1 of 3
28. (recycle_trash cleaner out trash2)
   deleted: (in-sack trash2)
   added: (recycle trash2) (empty-sack cleaner)
   goals met: 2 of 3
29. (drop_tool cleaner out vacuum)
   deleted: (holding vacuum)
   added: (at vacuum out) (empty-hands cleaner)
   goals met: 2 of 3
30. (move cleaner out r43)
   deleted: (at cleaner out)
   added: (at cleaner r43)
   goals met: 2 of 3
31. (grab_tool cleaner r43 key)
   deleted: (empty-hands cleaner) (at key r43)
   added: (holding key)
   goals met: 2 of 3
32. (move cleaner r43 r42)
   deleted: (at cleaner r43)
   added: (at cleaner r42)
   goals met: 2 of 3
33. (move cleaner r42 r41)
   deleted: (at cleaner r42)
   added: (at cleaner r41)
   goals met: 2 of 3
34. (move cleaner r41 r31)
   deleted: (at cleaner r41)
   added: (at cleaner r31)
   goals met: 2 of 3
35. (move cleaner r31 r21)
   deleted: (at cleaner r31)
   added: (at cleaner r21)
   goals met: 2 of 3
36. (open_room cleaner r21 r11 key)
   deleted: (door-between r21 r11) (door-between r11 r21)
   added: (half-open key)
   goals met: 2 of 3
37. (move cleaner r21 r11)
   deleted: (at cleaner r21)
   added: (at cleaner r11)
   goals met: 2 of 3
38. (put_in_sack cleaner r11 trash1)
   deleted: (empty-sack cleaner) (at trash1 r11)
   added: (in-sack trash1)
   goals met: 2 of 3
39. (move cleaner r11 r21)
   deleted: (at cleaner r11)
   added: (at cleaner r21)
   goals met: 2 of 3
40. (move cleaner r21 r31)
   deleted: (at cleaner r21)
   added: (at cleaner r31)
   goals met: 2 of 3
41. (move cleaner r31 r41)
   deleted: (at cleaner r31)
   added: (at cleaner r41)
   goals met: 2 of 3
42. (move cleaner r41 r42)
   deleted: (at cleaner r41)
   added: (at cleaner r42)
   goals met: 2 of 3
43. (move cleaner r42 r43)
   deleted: (at cleaner r42)
   added: (at cleaner r43)
   goals met: 2 of 3
44. (move cleaner r43 out)
   deleted: (at cleaner r43)
   added: (at cleaner out)
   goals met: 2 of 3
45. (recycle_trash cleaner out trash1)
   deleted: (in-sack trash1)
   added: (recycle trash1) (empty-sack cleaner)
   goals met: 3 of 3
